
__author__ = 'Шабельский Александр Александрович'

# Задача: используя цикл запрашивайте у пользователя число пока оно не станет больше 0, но меньше 10.
# После того, как пользователь введет корректное число, возведите его в степерь 2 и выведите на экран.
# Например, пользователь вводит число 123, вы сообщаете ему, что число не верное,
# и сообщаете об диапазоне допустимых. И просите ввести заного.
# Допустим пользователь ввел 2, оно подходит, возводим в степень 2, и выводим 4

n = int(input('Enter number: '))
while( n > 10 or n < 0):
    n = int(input('Please enter number > 0 and < 10: '))
n = n ** 2
print('Your number square is: ', n)

 
# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;

n = int(input())
m = int(input())
n , m = m , n
print(n, m)

